export const ResourceNationality: { [key: string]: string } = {
  vi: 'ベトナム',
  ph: 'フィリピン',
  th: 'タイ',
  km: 'カンボジア',
  cn: '中国',
  tw: '台湾',
  hk: '香港',
  my: 'ミャンマー',
  ne: 'ネパール',
  ko: '韓国',
  id: 'インドネシア',
  ms: 'マレーシア',
  hi: 'インド',
  bn: 'バングラデシュ',
  mn: 'モンゴル',
  sg: 'シンガポール',
  jp: '日本',
  others: 'その他',
};

export const JLPT: { [key: number]: string } = {
  1: 'N1',
  2: 'N2',
  3: 'N3',
  4: 'N4',
  5: 'N5',
  6: 'JLPT未受験',
};

export const ProgressStatus: { [key: number]: string } = {
  1: '求人票',
  2: '登録面談',
  3: '書類選考',
  4: '一次面接',
  5: '一次面接不合格',
  6: '二次面接',
  7: '二次面接不合格',
  8: '三次面接',
  9: '三次面接不合格',
  10: '筆記試験',
  11: '筆記試験不合格',
  12: '実技試験',
  13: '実技試験不合格',
  14: '最終面接',
  15: '最終面接不合格',
  16: '内定',
  17: '内定承諾',
  19: '内定辞退',
  20: '書類提出依頼',
  21: '書類回収',
  22: '様式作成',
  23: 'サイン捺印',
  24: '申請完了',
  25: '申請却下',
  26: '追加書類依頼',
  27: '通知書受け取り',
  28: '受領',
  29: '入社',
  30: '定期面談',
  31: '定期報告書作成',
  32: '定期報告書送付',
  33: '在留資格更新',
};

export const ResidentStatus: { [key: number]: string } = {
  1: '技能実習１号イ',
  2: '技能実習１号ロ',
  3: '技能実習2号イ',
  4: '技能実習2号ロ',
  5: '技能実習3号イ',
  6: '技能実習3号ロ',
  7: '特定技能1号',
  8: '特定技能2号',
  9: '文化活動',
  10: '短期滞在',
  11: '留学',
  12: '研修',
  13: '家族滞在',
  14: '特定活動',
  15: '永住者',
  16: '日本人の配偶者等',
  17: '永住者の配偶者等',
  18: '定住者',
  19: '外交',
  20: '公用',
  21: '教授',
  22: '芸術',
  23: '宗教',
  24: '報道',
  25: '高度専門職',
  26: '経営・管理',
  27: '法律・会計業務',
  28: '医療',
  29: '研究',
  30: '教育',
  31: '技術・人文知識・国際業務',
  32: '企業内転勤',
  33: '介護',
  34: '興行',
  35: '技能',
};

export const genderLabel: { [key: number]: string } = {
  1: '男性',
  2: '女性',
};

export const AgeSearch = (type?: string) => {
  const from = 18;
  const to = 49;
  const result: any[] = [];

  for (let i = from; i <= to; i++) {
    result.push({ value: i, label: i });
  }

  if (type === 'from') {
    result.push({ value: 50, label: '50歳以上' });
  }

  return result;
};
